Revit 2027 API
BuiltInFailures.SketchFailures.CannotConvertSketch Property
 Can't convert Sketch to Rebar Shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotConvertSketch { get; }
Public Shared ReadOnly Property CannotConvertSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotConvertSketch {
	FailureDefinitionId^ get ();
}
static member CannotConvertSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace